TAREA4/OPENESB/BPEL_DEPLOY/src/jbiServiceUnits/BPEL_DEPLOY.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="BPEL_DEPLOY"
             xmlns:tns="BPEL_DEPLOY" xmlns:ns="http://j2ee.netbeans.org/wsdl/BPEL/src/BPEL" xmlns:ns1="http://j2ee.netbeans.org/wsdl/SA/src/PedirUber" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/BPEL/src/BPEL" location="../jbiServiceUnits/BPEL/BPEL.wsdl"/>
    <import namespace="http://j2ee.netbeans.org/wsdl/SA/src/PedirUber" location="../jbiServiceUnits/SA/PedirUber.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns1:PedirUberPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="PedirUberOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="BPEL_DEPLOY"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="BPEL_DEPLOY"/>
            </output>
        </operation>
    </binding>
    <service name="BPEL_DEPLOYService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/BPEL_DEPLOYService1/casaPort1"/>
        </port>
    </service>
</definitions>
