TAREA4/OPENESB/BPEL_DEPLOY/test/results/TestCase1/Actual_20190828222345_S.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bpel="BPEL_DEPLOY">
  <soapenv:Body>
    <bpel:PedirUberOperation>
      <costo>50</costo>
      <part1>16</part1>
    </bpel:PedirUberOperation>
  </soapenv:Body>
</soapenv:Envelope>