TAREA4/OPENESB/BPEL_DEPLOY/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bpel="BPEL_DEPLOY">
  <soapenv:Body>
    <bpel:PedirUberOperation>
      <Id_Usuario>1</Id_Usuario>
    </bpel:PedirUberOperation>
  </soapenv:Body>
</soapenv:Envelope>